In [5]:
import pandas as pd
import numpy as np
marks = {'Chemistry' : [55,77,45,34],
        'Physics' : [25,36,84,25],
        'Mathematirs' : [25,34,87,36],
        'English' : [54,86,34,37]}
marks_df = pd.DataFrame(marks, index = ['subodh','veda','swetha','bhoomi'])
marks_df

        Chemistry  Physics  Mathematirs  English
subodh         55       25           25       54
veda           77       36           34       86
swetha         45       84           87       34
bhoomi         34       25           36       37

In [7]:
marks_df['total'] = marks_df['Chemistry']+marks_df['Physics']+marks_df['Mathematirs']+marks_df['English']
marks_df

        Chemistry  Physics  Mathematirs  English  total
subodh         55       25           25       54    159
veda           77       36           34       86    233
swetha         45       84           87       34    250
bhoomi         34       25           36       37    132

# Drop the total colum

In [8]:
marks_df.drop(columns='total',inplace=True)
marks_df

        Chemistry  Physics  Mathematirs  English
subodh         55       25           25       54
veda           77       36           34       86
swetha         45       84           87       34
bhoomi         34       25           36       37

# The teacher wants to get the total marks scored in each subject

In [9]:
marks_df.apply(np.sum,axis=0)

Chemistry      211
Physics        170
Mathematirs    182
English        211
dtype: int64

In [10]:
import pandas as pd
import numpy as np 
df=pd.read_csv('tips.csv')
df.head()

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           1       16.99  1.01  Female     No  Sun  Dinner     2
1           2       10.34  1.66    Male     No  Sun  Dinner     3
2           3       21.01  3.50    Male     No  Sun  Dinner     3
3           4       23.68  3.31    Male     No  Sun  Dinner     2
4           5       24.59  3.61  Female     No  Sun  Dinner     4

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  244 non-null    int64
 1   total_bill  244 non-null    float64
 2   tip         244 non-null    float64
 3   sex         244 non-null    object
 4   smoker      244 non-null    object
 5   day         244 non-null    object
 6   time        244 non-null    object
 7   size        244 non-null    int64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.4+ KB